#Считываем три числа с клавиатуры и разделяем их пробелом
b, q, n = map(int,input("Введите 3 значения 1. Первый элемент прогрессии 2. Множитель прогрессии 3. Номер последнего элемента: ").split())
#Проверbv, подходят ли введенные числа под ограничения задачи
if (b>=-10000  and b<=10000 and q>=1 and q<=50 and n>=2 and n<=100):
#Вычислим сумму первых n членов геометрической прогрессии по математической формуле
    s = (b*(q ** n - 1))/(q-1)
#Выведим полученный результат на экран
    print("Сумма геометрической прогрессии равна: ", s)
 # Если хотя бы одно число не прошло проверку,
 # выводим ошибку.
else:
    print("Некорректно введены числа")