#Запрашиваю у пользователя число, преобразую его из строки в целое число
n = int(input("Введите число от 1 до 25: "))
#Проверяю граничные случаи и условия задачи
if n <= 1:
#Числа 1 и меньше по правилам математики не могут быть простыми
    print("Число", n, "НЕ является простым")
elif n >= 25:
#Если пользователь ввёл число 25 или больше, сообщаю, что оно выходит за рамки условий
    print("Число", n, "НЕ соответсвует условию")
else:
#Перебираю потенциальные делители для числа n от 2 до n-1
    for i in range(2, n):
#Если остаток от деления n на i равен 0, значит нашел делитель. Число не простое
        if n % i == 0:
            print("Число", n, "НЕ является простым")
            break  # Останавливаю цикл, так как проверять дальше нет смысла
    else:
        # Этот блок сработает ТОЛЬКО если цикл for завершился сам 
        # и ни разу не наткнулся на команду break
        print("Число", n, "является простым")